sample_app/app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2018-12-02 00:35:45.242012"], ["id", 762146111]]
---
  def update
    if @user.update_attributes(user_params)